# -*- coding:utf-8 -*-
# 请实现一个函数用来判断字符串是否表示数值（包括整数和小数）。
# 例如，字符串"+100","5e2","-123","3.1416"和"-1E-16"都表示数值。
# 但是"12e","1a3.14","1.2.3","+-5"和"12e+4.3"都不是。

# 法1：利用库的正则匹配
# 注意特殊字符'+','.','*','?','^','$'，当要匹配该字符是要加上反斜杠，进行转义

# 法2：逐个字符比较匹配
# 借助状态变换图，可以清晰的表示匹配过程

class Solution:
    # s字符串
    def isNumeric(self, s):
        # write code here
        import re
        pattern = '(+|-)?(\d)+(.)?(\d)*\Z' # | ((+|-)?(\d)+(.)?(\d)*[Ee](+|-)?(\d)*\Z)'
        flag   =re.match(r'^[+-]?[0-9]*(\.[0-9]*)?([Ee][+-]?[0-9]+)?$',s)
        if flag:
            return True
        else:
            return False

# 测试
s = '1+23'
S = Solution()
print(S.isNumeric(s))